Autodesk.Revit.DB.Revision.CombineWithNext(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Combines the specified Revision with the next Revision.
Remarks:
All RevisionClouds and tags associated with the specified Revision will be reassigned
to the next Revision in the model and the specified Revision will be deleted from
the model.  The operation can only be performed if both the specified Revision and the
next one are unissued.
document:
The Document containing the Revisions.
revisionId:
The Revision that should have its clouds and tags associated with the next Revision.
Returns:
The ids of all RevisionClouds that were reassigned to the next Revision.
Throws Autodesk.Revit.Exceptions.ArgumentException:
revisionId is not a valid Revision.
-or-
This operation cannot be performed because revisionId is an issued Revision.
-or-
revisionId cannot be combined with the next Revision because either revisionId is
the last Revision or the next Revision has already been issued.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Revision.CombineWithPrevious(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Combines the specified Revision with the previous Revision.
Remarks:
All RevisionClouds and tags associated with the specified Revision will be reassigned
to the previous Revision in the model and the specified Revision will be deleted from
the model.  The operation can only be performed if both the specified Revision and the
previous one are unissued.
document:
The Document containing the Revisions.
revisionId:
The Revision that should have its clouds and tags associated with the previous Revision.
Returns:
The ids of all RevisionClouds that were reassigned to the previous Revision.
Throws Autodesk.Revit.Exceptions.ArgumentException:
revisionId is not a valid Revision.
-or-
This operation cannot be performed because revisionId is an issued Revision.
-or-
revisionId cannot be combined with the previous Revision because either revisionId is
the first Revision or the previous Revision has already been issued.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Revision.ReorderRevisionSequence(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Reorders the sequence of Revisions in the project.
Remarks:
This method allows the caller to change the sequence of the Revisions within the project by specifying the
new sequence.  The specified sequence must include every Revision in the project exactly once.
Note that changing the sequence of Revisions can change the SequenceNumber and RevisionNumber
of Revisions that have already been issued.
document:
The document in which the Revision sequence should be reordered.
newSequence:
The new sequence of Revisions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
newSequence does not contain every Revision exactly once.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Revision.Create(Autodesk.Revit.DB.Document)
Creates a new Revision in the project.
Remarks:
The new Revision will be added at the end of the sequence of existing Revisions.
document:
The document of the new Revision.
Returns:
The newly created Revision.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Revision.GetAllRevisionIds(Autodesk.Revit.DB.Document)
Returns the ids of all Revisions in the project ordered by sequence number.
document:
The document containing the Revisions.
Returns:
The ids of all the Revisions in the document ordered by sequence number.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Revision.NumberType
Indicates what number type the Revision Number for this Revision should use.
Remarks:
This property defines how the Revision Number (not including any user-specified prefix or suffix) will be assigned
and displayed.
RevisionNumberType.Numeric:  Revision Numbers will be consecutive integers, starting by default with a
value of 1.  Alternatively, the starting value can be set to any non-negative value using the
NumericRevisionSettings stored in the project-wide RevisionSettings.RevisionNumberType.Alphabetic:  This number type has been replaced by RevisionNumberType.Alphanumeric.RevisionNumberType.None:  The Revision Number will always be the empty string.RevisionNumberType.Alphanumeric:  The Revision Numbers will be taken consecutively from a list of arbitrary
strings, specified in the AlphanumericRevisionSettings object stored in the project-wide RevisionSettings.
Revision numbers will always be assigned in revision sequence order.  Any prefixes or suffixes specified in the
NumericRevisionSettings and AlphanumericRevisionSettings will be prepended or appended respectively to the
Revision Number assigned to the Revision.
If the project contains a mix of Revision objects with different NumberTypes then the Revisions using a
particular NumberType will always be assigned consecutive revision numbers.  In other words, the first three
numeric Revisions in the project will always be assigned revision numbers 1, 2, and 3, even if the revision
sequence includes intervening Revisions that are alphabetic or not numbered.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation cannot be performed on Revisions that have already been issued.
Since:
2015

Autodesk.Revit.DB.Revision.Visibility
Controls the visibility of revision clouds and revision tags related to this Revision.
Remarks:
This property provides project-wide control over the visibility of revision clouds and tags associated with this
Revision.  If clouds or tags are hidden by this property they will not be visible in any views regardless of the
view's settings.  If clouds or tags are visible according to this property they may still be hidden on a particular
view or sheet.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Revision.RevisionDate
The date of this Revision.
Remarks:
The Revision date is an arbitrary String and can be blank.  Revit will not
attempt to interpret it as an actual date.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation cannot be performed on Revisions that have already been issued.
Since:
2015

Autodesk.Revit.DB.Revision.IssuedBy
Indicates who has issued or will issue this Revision.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation cannot be performed on Revisions that have already been issued.
Since:
2015

Autodesk.Revit.DB.Revision.IssuedTo
Indicates to whom this Revision was or will be issued.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation cannot be performed on Revisions that have already been issued.
Since:
2015

Autodesk.Revit.DB.Revision.Issued
Indicates whether this Revision has been issued.
Since:
2015

Autodesk.Revit.DB.Revision.Description
The description of this Revision.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation cannot be performed on Revisions that have already been issued.
Since:
2015

Autodesk.Revit.DB.Revision.RevisionNumber
The Revision number of this revision.
Remarks:
Note that this field is only available if the RevisionSettings are set to number revisions PerProject.
When Revisions are numbered PerSheet, a given Revision may display a different RevisionNumber on each sheet.
In this case, the revision number can be obtained by calling Autodesk::Revit::DB::ViewSheet::GetRevisionNumberOnSheet().
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is not valid for when the revision numbering is per sheet.
Since:
2015

Autodesk.Revit.DB.Revision.SequenceNumber
The Sequence Number of this Revision.
Remarks:
Every Revision in the project will be assigned a consecutive sequence number starting with 1.
This number corresponds to the ordering of the Revisions.  If a Revision is deleted, subsequent
Revisions will update their sequence numbers to maintain a consecutive list.
Since:
2015

Autodesk.Revit.DB.Revision
Represents a single revision in the project.
Remarks:
The Revision object represents the data related to a single revision in the project.
Revision clouds and tags can be associated with a particular Revision object to display
its properties on sheets.
The revisions in the project are stored in a specific order called the revision
sequence.  The revision sequence represents the conceptual sequence in which revisions
will be issued.
Since:
2015